# GetMatchingPreset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..GetMatchingPreset Method
SunAndShadowSettings Class See Also
---
Finds the name of the 'per-document' SunAndShadowSettings that matches the properties of this per-view element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetMatchingPreset()
```

Visual Basic
---
```text
Public Function GetMatchingPreset As String
```

Visual C++
---
```text
public:
String^ GetMatchingPreset()
```

# ### Return Value
Name of the per-document SunAndShadowSettings that matches the view specific element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The SunAndShadowSettings is not view-specific. |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace